gcc -g p2original.c;./a.out
enter 3 numbers
64
55
34
biggest number is 64 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x82c: file p2original.c, line 21.
 gcc -g p2original.c;./a.out
enter 3 numbers
25
44
32
biggest number is 44 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
 gcc -g p2original.c;./a.out
enter 3 numbers
1
6
8
biggest number is 8 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x82c: file p2original.c, line 21.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2original.c:21
21  {
(gdb) n
23    input(&x,&y,&z);
(gdb) s
input (a=0x7fff3874d238, b=0x7fff3874d23c, 
    c=0x7fff3874d240) at p2original.c:4
4     printf("enter 3 numbers\n");
(gdb) p
The history is empty.
(gdb) c
Continuing.
enter 3 numbers
1
6
8
biggest number is 8[Inferior 1 (process 231) exited normally]
(gdb) l
1   #include <stdio.h>
2   int input(int *a,int *b,int*c)
3   {
4     printf("enter 3 numbers\n");
5     scanf("%d%d%d",a,b,c);
6   }
7   int cmp (int a,int b,int c,int *big)
8   {
9     if ((a>b)&&(a>c))
10    *big=a;
(gdb) #include <stdio.h>
(gdb) int input(int *a,int *b,int*c)
Ambiguous command "int input(int *a,int *b,int*c)": internals, interpreter-exec, interrupt.
(gdb) {
Undefined command: "".  Try "help".
(gdb)   printf("enter 3 numbers\n");
Bad format string, missing '"'.
(gdb)   scanf("%d%d%d",a,b,c);
Undefined command: "scanf".  Try "help".
(gdb) }
Undefined command: "".  Try "help".
(gdb) int cmp (int a,int b,int c,int *big)
Ambiguous command "int cmp (int a,int b,int c,int *big)": internals, interpreter-exec, interrupt.
(gdb) {
Undefined command: "".  Try "help".
(gdb)   if ((a>b)&&(a>c))
 >  *big=a;
 >  else if((b>a)&&(b>c))
 >  *big=b;
 >  else
 >  *big=c;
 >}
 >int output(int big)
 >{
 >  printf("biggest number is %d",big);
 >}
 >int main ()
 >{
 >  int x,y,z,big;
 >  input(&x,&y,&z);
 >  cmp(x,y,z,&big);
 >  output(big);
 >  return 0;
 >}