gcc -g p7original.c;./a.out
Enter the Real part: 2
Enter the Imaginar part: 3
Enter the Real part: 4
Enter the Imaginar part: 5
The sum of 6.0 + 8.0i 
 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x828: file p7original.c, line 31.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p7original.c:31
31    c1= input();
(gdb) n
Enter the Real part: 2
Enter the Imaginar part: 3
32    c2= input();
(gdb) n
Enter the Real part: 4
Enter the Imaginar part: 5
33    sum=add(c1,c2);
(gdb) s
add (a=..., b=...) at p7original.c:20
20    sum.real = a.real + b.real;
(gdb) p
The history is empty.
(gdb) c
Continuing.
The sum of 6.0 + 8.0i[Inferior 1 (process 697) exited normally]
(gdb) l
15    return c;
16  }
17  complex add(complex a, complex b)
18  {
19    complex sum;
20    sum.real = a.real + b.real;
21    sum.imaginary = a.imaginary + b.imaginary;
22    return sum;
23  }
24  void output(complex sum)
(gdb) 