gcc -g p8original.c;./a.out
Enter the number of complex numbers: 4
Enter the real part: 2
Enter the imaginary part: 2
Enter the real part: 3
Enter the imaginary part: 3
Enter the real part: 4
Enter the imaginary part: 4
Enter the real part: 5
Enter the imaginary part: 5
2.00+2.00i
3.00+3.00i
4.00+4.00i
+ 5.00 + 5.00i is
14.00 + 14.00i
 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0xa3f: file p8original.c, line 71.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p8original.c:71
71  {
(gdb) n
72      int n = get_n();
(gdb) n
Enter the number of complex numbers: 4
73      Complex c[n], res;
(gdb) n
74      input_n_complex(n, c);
(gdb) s
input_n_complex (n=4, c=0x7fff1d41f940) at p8original.c:29
29      for (int i=0; i<n; i++)
(gdb) n
31          c[i] = input_complex();
(gdb) p
The history is empty.
(gdb) c
Continuing.
Enter the real part: 2
Enter the imaginary part: 2
Enter the real part: 3
Enter the imaginary part: 3
Enter the real part: 4
Enter the imaginary part: 4
Enter the real part: 5
Enter the imaginary part: 5
2.00+2.00i
3.00+3.00i
4.00+4.00i
+ 5.00 + 5.00i is
14.00 + 14.00i
[Inferior 1 (process 908) exited normally]
(gdb) l
26
27  void input_n_complex(int n, Complex c[n])
28  {
29      for (int i=0; i<n; i++)
30      {
31          c[i] = input_complex();
32      }
33  }
34
35  Complex add(Complex a, Complex b)
(gdb) 